# Relational Database Coursework

**Group:** ?group_number?

**ToDo:** Give your group number above and add group member names, usernames, and contributions in the below table (double click on this cell to edit the content)

| Username | Name | Summary of contribution |
|----------|------|-------------------------|
| me97 | Mohamed Elauzei   | Full contribution |
| mib2 | Mahmud Ibr Bennis | Full contribution |

Students have been supplied this skeleton notebook for completing their F21DF coursework.

This notebook makes use of the [IPython SQL magic](https://github.com/catherinedevlin/ipython-sql) developed by [Catherine Devlin's](http://catherinedevlin.blogspot.com/). Magics are a mechanism within Jupyter to achieve some specific feature within Python such as executing SQL commands over a database. An overview of magics can be found in the [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/01.03-magic-commands.html).

Students are required to complete all sections of this notebook and then submit it according to the supplied instructions.

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Connect-to-the-MACS-Database-Server" data-toc-modified-id="Connect-to-the-MACS-Database-Server-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Connect to the MACS Database Server</a></span></li><li><span><a href="#Database-Design-[10-Marks]" data-toc-modified-id="Database-Design-[10-Marks]-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Database Design [10 Marks]</a></span></li><li><span><a href="#Relational-Schema-[10-Marks]" data-toc-modified-id="Relational-Schema-[10-Marks]-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Relational Schema [10 Marks]</a></span></li><li><span><a href="#Loading-Data-[5-Marks]" data-toc-modified-id="Loading-Data-[5-Marks]-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Loading Data [5 Marks]</a></span></li><li><span><a href="#Querying-the-Database-[20-Marks]" data-toc-modified-id="Querying-the-Database-[20-Marks]-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Querying the Database [20 Marks]</a></span></li></ul></div>

## Connect to the MACS Database Server

If the following commands do not work, then refer to the lab notebooks used in the course.

In [1]:
# Load the SQL magics for jupyter
%load_ext sql

In [3]:
# Establish connection to MACS Database Server
from getpass import getpass
username = input('Enter your mysql username: ')
password = getpass(prompt='Enter your mysql password: ')
connection_string = "mysql+pymysql://{username}:{password}@mysql-server-1.macs.hw.ac.uk:3306/{username}".format(username=username, password=password)
%sql $connection_string

Enter your mysql username: mib2
Enter your mysql password: ········

'Connected: mib2@mib2'

## 1. Database Design [10 Marks]

**ToDo:** Provide the ER diagram for your database. Save your ER diagram in the same directory as this notebook as a png file with the filename `erDiagram.png`.

<img src="erDiagram.png" alt="Drawing" style="width: 600px;"/>

**ToDo:** Give a brief overview of your diagram detailing any design decisions made, and constraints that could not be captured.
•	We added guestId to guest table because the name may not be a unique identifier for a person.
•   We decided to make Reservation a Ternary relationship based on the fact that it connects 3 entities; Hoetl, Guest and Room.
•   We made RoomCategory its own entity instead of an attribute of room based on this part of the requirements "The room category.. determines the capacity.. and the rate.. Note that not all hotels offer all room types"

## 2. Relational Schema [10 Marks]

**ToDo:** Using the following table template, provide the data dictionary for the relational schema you have generated from your ER diagram.

**Hotel**

| Attribute 	| Description 			| Domain 						| Null? | Primary Key 	| Foreign Key 	|
|---------------|-----------------------|-------------------------------|-------|---------------|---------------|
| hotName 		| Hotel Name			| varchar(30)					| N 	| Y 			| N 			|
| hotDescription| Hotel Description		| varchar(500)					| Y 	| N 			| N 			|
| hotRating	    | Hotel Rating 			| ENUM('1','2','3','4','5')		| N 	| N 			| N 			|
| hotStreet		| Hotel Street Name		| varchar(20)					| N 	| N 			| N 			|
| hotCity 		| Hotel City 			| varchar(20)					| N 	| N 			| N 			|
| hotCountry	| Hotel Country			| varchar(20)					| N 	| N 			| N 			|

**Guest**

| Attribute		| Description 			| Domain 						| Null? | Primary Key 	| Foreign Key 	|
|---------------|-----------------------|-------------------------------|-------|---------------|---------------|
| guestID		| Guest ID Number 		| char(5)					    | N 	| Y 			| N 			|
| gusName		| Guest Name			| varchar(20)					| N 	| N 			| N 			|
| gusAddress	| Full Address 			| varchar(20)					| N 	| N 			| N 			|
| gusPhoneNu	| Phone Number			| varchar(15)					| N 	| N 			| N 			|
| gusEmail		| Guest Email Address	| varchar(30)					| N 	| N 			| N 			|

**RoomCategory**

| Attribute		| Description 	| Domain 											| Null? | Primary Key 	| Foreign Key 	|
|---------------|---------------|---------------------------------------------------|-------|---------------|---------------|
| roCategory	| Room Category	| ENUM('single','double','twin','studio','family')	| N 	| Y 			| N 			|
| roCapacity	| Room Capacity	| ENUM('1','2','3+')								| N 	| N 			| N 			|

**Room**

| Attribute			| Description 				| Domain 											| Null? | Primary Key 	| Foreign Key 	|
|---------------|-----------------------|-------------------------------|-------|---------------|---------------|
| roomNumber		| Room Number				| varchar(20)										| N 	| Y 			| N 			|
| roDescription		| Room Description			| varchar(20)										| N 	| N 			| N 			|
| roLastRenovation	| Date of Last Renovation	| date												| N 	| N 			| N 			|
| guestID			| Guest ID Number 			| varchar(20)										| Y 	| N 			| Guest.guestID	|
| hotName			| Hotel Name				| varchar(20)										| N 	| Y 			| Hotel.hotName |
| roCategory		| Room Category				| ENUM('single','double','twin','studio','family')	| N 	| N 			| RoomCategory.roCategory|

In [ ]:
EXPLANATION...
Room has its primary key composed of its number and its hotel name, because a room number may be redundant across 
hotels but since hotel names are unique, a composed key of room number and hotel name will be a good primary key.

**Reservation**

| Attribute		| Description 		| Domain 						| Null? | Primary Key 	| Foreign Key 		|
|---------------|-------------------|-------------------------------|-------|---------------|-------------------|
| checkIn		| Check In Date 	| date							| N 	| Y 			| N 				|
| checkOut		| Check Out Date	| date							| N 	| N 			| N 				|
| guestID		| Guest ID Number	| varchar(5)					| N 	| Y 			| Guest.guestID		|
| hotName		| Hotel Name		| varchar(20)					| N 	| Y 			| Hotel.hotName		|
| roomNumber	| Room Number		| varchar(5)					| N 	| Y 			| Room.roomNumber	|

In [ ]:
EXPLANATION...
Reservation is a Ternary relationship that connects Guest with Hotel with Room. It was given its own relation as 
per the guidelines and its primary key is a composite one consisting of the checkIn date of the reservation with the 
primary keys of the entities it connects.

**RoomCost**

| Attribute		| Description 			| Domain 											| Null? | Primary Key 	| Foreign Key 		|
|---------------|-----------------------|-------------------------------|-------|---------------|---------------|
| roCategory	| Room Category			| ENUM('single','double','twin','studio','family')	| N 	| Y 			| RoomCategory.roCategory|
| roCost		| Room Cost per Naight	| double(5,2)										| N 	| Y 			| N					|

In [ ]:
EXPLANATION...
RoomCost was given its own relation as it’s a multi-valued attribute in RoomCategory that is likely to constantly change. 
Its primary key is a composite of its key and the primary key of its parent. The same thing wasn’t done for capacity 
because the capacity of the category of a room is not likely to constantly change. A double room will always hold 2 people 
maximum and never more.

**HotelRoomCategory**

| Attribute		| Description 	| Domain 											| Null? | Primary Key 	| Foreign Key 		|
|---------------|-----------------------|-------------------------------|-------|---------------|---------------|
| hotName		| Hotel Name	| varchar(20)										| N 	| Y 			| Hotel.hotName		|
| roCategory	| Room Category	| ENUM('single','double','twin','studio','family')	| N 	| Y 			| RoomCategory.roCategory	|

In [ ]:
EXPLANATION...
HotelRoomCategory is a joining table resulting from the M:N relationship between Hotel and RoomCategory. 
Its primary key is a composite of both tables’ primary keys.

**HotelGuest**

| Attribute		| Description 		| Domain 			| Null? | Primary Key 	| Foreign Key 		|
|---------------|-------------------|-------------------|-------|---------------|-------------------|
| numOfVisits	| Number of visits	| varchar(5)		| N 	| N 			| N 				|
| hotName		| Hotel Name		| varchar(20)		| N 	| Y 			| Hotel.hotName 	|
| guestID		| Guest ID Number	| varchar(5)		| N 	| Y 			| Guest.guestID		|

In [ ]:
EXPLANATION...
HotelGuest is a joining table resulting from the M:N relationship between Guest and Hotel. 
Its primary key is a composite of both tables’ primary keys.
The numOfVisits attribute was added to the relation because it is an attribute of the relationship between the 2 tables 
(as shown in the ERD). Its value will be computed in SQL.

## 3. Schema Implementation [10 Marks]

**ToDo:** For each table in your relational schema, give the SQL CREATE statement for the table in one cell and the insert statements in a separate cell. Use markdown cells to describe the table and give any design decisions.

Explanation ...
enum data type used for rating as it is a multi-valued attribute that is not likely to change.

In [5]:
%%sql
DROP TABLE IF EXISTS Hotel;
CREATE TABLE Hotel (
	hotName			varchar(20) PRIMARY KEY,
	hotDescription	varchar(500),
	starRating 		ENUM('1','2','3','4','5') NOT NULL,
	hotStreet 		varchar(20)	NOT NULL,
	hotCity			varchar(20) NOT NULL,
	hotCountry		varchar(20) NOT NULL
) ENGINE=InnoDB

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO Hotel (hotName, hotDescription, starRating, hotStreet, hotCity, hotCountry) VALUES 
('Afriqa', 'The Best hotel ever', '3', 'Smithfield St', 'Edinburgh', 'Scotland'),
('Radisson Blu', 'The Best service ever', '4', 'Royal Mile St', 'London', 'UK'),
('Hilton', 'Will not regret', '5', 'Saint George St', 'Nies', 'France'),
('The Building', 'Italian Quality', '4', 'Giovanni St', 'Rome', 'Italy'),
('Halloween', 'The Best hotel ever', '4','Center', 'Rome', 'Italy'),
('Hotel Lemonade', 'The Best hotel ever', '4','wnerey', 'Madrid', 'Spain'),
('Knights Inn', 'The Best hotel ever', '5','NY3 street', 'New York', 'USA'),
('livin hub', 'The Best hotel ever', '5','Grove', 'Edinburgh', 'Scotland'),
('Mahari', 'The Best hotel ever', '3','ASD st', 'Tripoli', 'Libya'),
('Rome', 'The Best hotel ever', '4','Oxofrd st', 'London', 'England'),
('Breakfast Hotel', 'The Best hotel ever', '3','Prince', 'Edinburgh', 'Scotland'),
('The Paradise Inn', 'The Best hotel ever', '5','Fountbridge', 'Edinburgh', 'Scotland'),
('Vision Resort', 'The Best hotel ever', '4','High street', 'Manchester', 'England'),
('Welcome Stay', 'The Best hotel ever', '3','Smith street', 'Glasgow', 'Scotland');

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
14 rows affected.

[]

In [7]:
%%sql
SELECT * FROM Hotel

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
14 rows affected.

[('Afriqa', 'The Best hotel ever', '3', 'Smithfield St', 'Edinburgh', 'Scotland'),
 ('Breakfast Hotel', 'The Best hotel ever', '3', 'Prince', 'Edinburgh', 'Scotland'),
 ('Halloween', 'The Best hotel ever', '4', 'Center', 'Rome', 'Italy'),
 ('Hilton', 'Will not regret', '5', 'Saint George St', 'Nies', 'France'),
 ('Hotel Lemonade', 'The Best hotel ever', '4', 'wnerey', 'Madrid', 'Spain'),
 ('Knights Inn', 'The Best hotel ever', '5', 'NY3 street', 'New York', 'USA'),
 ('livin hub', 'The Best hotel ever', '5', 'Grove', 'Edinburgh', 'Scotland'),
 ('Mahari', 'The Best hotel ever', '3', 'ASD st', 'Tripoli', 'Libya'),
 ('Radisson Blu', 'The Best service ever', '4', 'Royal Mile St', 'London', 'UK'),
 ('Rome', 'The Best hotel ever', '4', 'Oxofrd st', 'London', 'England'),
 ('The Building', 'Italian Quality', '4', 'Giovanni St', 'Rome', 'Italy'),
 ('The Paradise Inn', 'The Best hotel ever', '5', 'Fountbridge', 'Edinburgh', 'Scotland'),
 ('Vision Resort', 'The Best hotel ever', '4', 'High street', 'Manchester', 'England'),
 ('Welcome Stay', 'The Best hotel ever', '3', 'Smith street', 'Glasgow', 'Scotland')]

Explanation ...
char data type was preferred for guestID instead of varchar because it will be a fixed-length value for all guests, and thus will take less space than varchar. It's prefered to numeric data types to allow the use of other characters.

In [9]:
%%sql
DROP TABLE IF EXISTS Guest;
CREATE TABLE Guest (
	guestID varchar(5) PRIMARY KEY,
	gusName varchar(20) NOT NULL,
	gusAddress varchar(20) NOT NULL,
	gusPhoneNu varchar(15) NOT NULL,
	gusEmail varchar(30) NOT NULL
) ENGINE=InnoDB

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql
INSERT INTO Guest (guestID, gusName, gusAddress, gusPhoneNu, gusEmail) VALUES 
('G0001', 'Sara Johnson', 'Istanbul, Turkey', '+1 435562864','sara.jo@hotmail.com'),
('G0002', 'Mike Jackson', 'California , USA', '+2 630525385','mike.ja@gmail.com'),
('G0003', 'Crisiant Manuel', 'Paries, France', '+3 564385642','crisiant.m@hotmail.com'),
('G0004', ' Andrew Smith', 'Iowa , USA', '+4 256303585','andrew.smith@gmail.com'),
('G0005', 'Mohamed Bennis', 'Tripoli, Libya', '+5 288128378', 'mohamed@gmail.com'),
('G0006', 'Jack Jhon', 'LA, USA', '+6 123477970', 'jack@gmail.com'),
('G0007', 'Jessica Marro', 'London, England', '+7 389264986', 'Jessica@gmail.com'),
('G0008', 'Robin Russil', 'Rome, Italy', '+8 284974285', 'robin@gmail.com'),
('G0009', 'Gary Roben', 'Manchester, England', '+9 748265098', 'gary@gmail.com'),
('G0010', 'William Smith', 'Edinburgh, Scotland', '+10 290028965', 'william@gmail.com'),
('G0011', 'Laura Gray', 'Glasgow, Scotland', '+11 752379859', 'laura@gmail.com'),
('G0012', 'Bin Mike', 'Paris, France', '+12 823859027', 'bin@gmail.com'),
('G0013', 'Jared Crowe', 'New York, USA', '+13 897402897', 'jared@gmail.com'),
('G0014', 'Lee Will', 'Bejeing, China', '+14 838727877', 'lee@gmail.com');

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
14 rows affected.

[]

In [11]:
%%sql
SELECT * FROM Guest

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
14 rows affected.

[('G0001', 'Sara Johnson', 'Istanbul, Turkey', '+1 435562864', 'sara.jo@hotmail.com'),
 ('G0002', 'Mike Jackson', 'California , USA', '+2 630525385', 'mike.ja@gmail.com'),
 ('G0003', 'Crisiant Manuel', 'Paries, France', '+3 564385642', 'crisiant.m@hotmail.com'),
 ('G0004', ' Andrew Smith', 'Iowa , USA', '+4 256303585', 'andrew.smith@gmail.com'),
 ('G0005', 'Mohamed Bennis', 'Tripoli, Libya', '+5 288128378', 'mohamed@gmail.com'),
 ('G0006', 'Jack Jhon', 'LA, USA', '+6 123477970', 'jack@gmail.com'),
 ('G0007', 'Jessica Marro', 'London, England', '+7 389264986', 'Jessica@gmail.com'),
 ('G0008', 'Robin Russil', 'Rome, Italy', '+8 284974285', 'robin@gmail.com'),
 ('G0009', 'Gary Roben', 'Manchester, England', '+9 748265098', 'gary@gmail.com'),
 ('G0010', 'William Smith', 'Edinburgh, Scotland', '+10 290028965', 'william@gmail.com'),
 ('G0011', 'Laura Gray', 'Glasgow, Scotland', '+11 752379859', 'laura@gmail.com'),
 ('G0012', 'Bin Mike', 'Paris, France', '+12 823859027', 'bin@gmail.com'),
 ('G0013', 'Jared Crowe', 'New York, USA', '+13 897402897', 'jared@gmail.com'),
 ('G0014', 'Lee Will', 'Bejeing, China', '+14 838727877', 'lee@gmail.com')]

In [ ]:
Explanation ...
enum data type used for both columns as they are both multi-valued attributes that are not likely to change very often.

In [13]:
%%sql
DROP TABLE IF EXISTS RoomCategory;
CREATE TABLE RoomCategory (
	roCategory ENUM('single','double','twin','studio','family') PRIMARY KEY,
	roCapacity ENUM('1','2','3+') NOT NULL
) ENGINE=InnoDB

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql
INSERT INTO RoomCategory (roCategory, roCapacity) VALUES 
('single', '1'),
('double', '2'),
('twin', '2'),
('studio', '2'),
('family', '3+');

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
5 rows affected.

[]

In [15]:
%%sql
SELECT * FROM RoomCategory

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
5 rows affected.

[('single', '1'),
 ('double', '2'),
 ('twin', '2'),
 ('studio', '2'),
 ('family', '3+')]

Explanation ...
char data type was preferred for roomNumber instead of varchar because it will be a fixed-length value for all rooms, and thus will take less space than varchar. It's prefered to numeric data types to allow the use of other characters. Forexample, room in the first floor would be 101. In the third floor it's 301 and so on.

In [17]:
%%sql
DROP TABLE IF EXISTS Room;
CREATE TABLE Room (
	roomNumber varchar(20) NOT NULL,
	roDescription varchar(20) NOT NULL,
	roLastRenovation date NOT NULL,
	guestID varchar(20),
	hotName varchar(20) NOT NULL,
	roCategory ENUM('single','double','twin','studio','family') NOT NULL,
	PRIMARY KEY (roomNumber,hotName)
) ENGINE=InnoDB

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.
0 rows affected.

[]

In [ ]:
Explanation ...
ON DELETE NO ACTION for guestId so a room wont be deleted just because the guest record no longer available.
ON DELETE RESTRICT for roCategory to give the user options on what to do with a room when its type deleted.
ON DELETE CASCADE for hotelName because the existance of a room is dependant on its hotel.
ON UPDATE CASCADE for all of them to keep information in the database up to date.

In [18]:
%%sql
ALTER TABLE Room 
ADD FOREIGN KEY (guestID) REFERENCES Guest (guestID) ON UPDATE CASCADE ON DELETE NO ACTION,
ADD FOREIGN KEY (hotName) REFERENCES Hotel (hotName) ON UPDATE CASCADE ON DELETE CASCADE,
ADD FOREIGN KEY (roCategory) REFERENCES RoomCategory (roCategory) ON UPDATE CASCADE ON DELETE RESTRICT;

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.

[]

In [19]:
%%sql
INSERT INTO Room (roomNumber, roDescription, roLastRenovation, guestID, hotName, roCategory) VALUES 
('201', 'Nice room', '2019-02-01', 'G0001', 'Radisson Blu', 'single'),
('107', 'Great for couples', '2018-05-01', 'G0002', 'Afriqa', 'double'),
('101', 'The Best', '2019-03-04', 'G0003', 'Hilton', 'studio'),
('203', 'Feels like home', '2019-01-12', 'G0004', 'The Building', 'family'),
('100', 'Nice room', '2019-02-11', 'G0014', 'Halloween', 'double'),
('104', 'Feels like home' , '2019-01-07', 'G0008', 'Vision Resort', 'family'),
('102', 'Nice room', '2019-09-04', 'G0010', 'livin hub', 'double'),
('103', 'Feels like home' , '2019-05-05', 'G0013', 'Welcome Stay', 'studio'),
('111', 'Nice room', '2019-09-07', 'G0005', 'The Paradise Inn', 'single'),
('112', 'Feels like home' , '2019-04-02', 'G0012', 'The Paradise Inn', 'family'),
('115', 'Nice room', '2019-03-03', 'G0013', 'The Paradise Inn', 'family'),
('116', 'The Best', '2019-02-07', 'G0006', 'The Paradise Inn', 'family'),
('119', 'The Best', '2019-01-05', 'G0010', 'The Paradise Inn', 'family'),
('122', 'Feels like home', '2019-05-01', 'G0009', 'livin hub', 'single'),
('123', 'Feels like home', '2019-04-07', 'G0011', 'The Paradise Inn', 'family'),
('132', 'The Best', '2019-02-04', 'G0007', 'The Paradise Inn', 'family'),
('150', 'Feels like home', '2019-01-11', 'G0012', 'Halloween', 'double');
INSERT INTO Room (roomNumber, roDescription, roLastRenovation, hotName, roCategory) VALUES
('202', 'Nice room', '2019-02-01', 'Radisson Blu', 'family'),
('204', 'Feels like home', '2019-01-12', 'The Building', 'family'),
('205', 'Feels like home', '2019-01-12', 'The Building', 'family'),
('206', 'Feels like home', '2019-01-12', 'The Building', 'family');

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
17 rows affected.
4 rows affected.

[]

In [20]:
%%sql
SELECT * FROM Room

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
21 rows affected.

[('100', 'Nice room', datetime.date(2019, 2, 11), 'G0014', 'Halloween', 'double'),
 ('101', 'The Best', datetime.date(2019, 3, 4), 'G0003', 'Hilton', 'studio'),
 ('102', 'Nice room', datetime.date(2019, 9, 4), 'G0010', 'livin hub', 'double'),
 ('103', 'Feels like home', datetime.date(2019, 5, 5), 'G0013', 'Welcome Stay', 'studio'),
 ('104', 'Feels like home', datetime.date(2019, 1, 7), 'G0008', 'Vision Resort', 'family'),
 ('107', 'Great for couples', datetime.date(2018, 5, 1), 'G0002', 'Afriqa', 'double'),
 ('111', 'Nice room', datetime.date(2019, 9, 7), 'G0005', 'The Paradise Inn', 'single'),
 ('112', 'Feels like home', datetime.date(2019, 4, 2), 'G0012', 'The Paradise Inn', 'family'),
 ('115', 'Nice room', datetime.date(2019, 3, 3), 'G0013', 'The Paradise Inn', 'family'),
 ('116', 'The Best', datetime.date(2019, 2, 7), 'G0006', 'The Paradise Inn', 'family'),
 ('119', 'The Best', datetime.date(2019, 1, 5), 'G0010', 'The Paradise Inn', 'family'),
 ('122', 'Feels like home', datetime.date(2019, 5, 1), 'G0009', 'livin hub', 'single'),
 ('123', 'Feels like home', datetime.date(2019, 4, 7), 'G0011', 'The Paradise Inn', 'family'),
 ('132', 'The Best', datetime.date(2019, 2, 4), 'G0007', 'The Paradise Inn', 'family'),
 ('150', 'Feels like home', datetime.date(2019, 1, 11), 'G0012', 'Halloween', 'double'),
 ('201', 'Nice room', datetime.date(2019, 2, 1), 'G0001', 'Radisson Blu', 'single'),
 ('202', 'Nice room', datetime.date(2019, 2, 1), None, 'Radisson Blu', 'family'),
 ('203', 'Feels like home', datetime.date(2019, 1, 12), 'G0004', 'The Building', 'family'),
 ('204', 'Feels like home', datetime.date(2019, 1, 12), None, 'The Building', 'family'),
 ('205', 'Feels like home', datetime.date(2019, 1, 12), None, 'The Building', 'family'),
 ('206', 'Feels like home', datetime.date(2019, 1, 12), None, 'The Building', 'family')]

In [22]:
%%sql
DROP TABLE IF EXISTS Reservation;
CREATE TABLE Reservation (
	guestID varchar(5) NOT NULL,
	roomNumber varchar(5) NOT NULL,
	hotName varchar(20)	NOT NULL,
	checkIn	date NOT NULL,
	checkOut date NOT NULL,
	PRIMARY KEY (guestID,hotName,roomNumber,checkIn)
) ENGINE=InnoDB

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.
0 rows affected.

[]

Explanation ...
ON UPDATE CASCADE for all foreign keys to keep reservation details up to date.
ON DELETE RESTRICT for all foreign keys to give the user the opportuinity to decide what happens to a reservation when the guest is deleted for example. This depends on wethere the reservation is an old one or future one. If it's for future booking, the reservation may be deleted, but for old ones, the reservation will probably still be kept.

In [23]:
%%sql
ALTER TABLE Reservation 
ADD FOREIGN KEY (guestID) REFERENCES Guest (guestID) ON UPDATE CASCADE ON DELETE RESTRICT,
ADD FOREIGN KEY (roomNumber, hotName) REFERENCES Room (roomNumber, hotName) ON UPDATE CASCADE ON DELETE RESTRICT;

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.

[]

In [24]:
%%sql
INSERT INTO Reservation (guestID, roomNumber, hotName, checkIn, checkOut) VALUES
('G0001', '201', 'Radisson Blu', '2019-05-29', '2019-06-05'),
('G0002', '107', 'Afriqa', '2019-06-12', '2019-06-17'),
('G0003', '101', 'Hilton', '2019-10-20', '2019-10-29'),
('G0004', '203', 'The Building', '2019-10-15', '2019-10-25'),
('G0005', '100', 'Halloween', '2019-09-01', '2019-09-04'),
('G0005', '111', 'The Paradise Inn', '2019-09-09', '2019-09-13'),
('G0007', '116', 'The Paradise Inn', '2019-09-03', '2019-09-08'),
('G0007', '122', 'livin hub', '2019-11-26', '2019-11-29'),
('G0010', '104', 'Vision Resort', '2019-09-03', '2019-09-04'),
('G0010', '104', 'Vision Resort', '2019-09-10', '2019-09-12'),
('G0011', '132', 'The Paradise Inn', '2019-10-24', '2019-10-27'),
('G0011', '150', 'Halloween', '2019-10-24', '2019-10-26'),
('G0012', '103', 'Welcome Stay', '2019-09-03', '2019-09-04'),
('G0013', '100', 'Halloween', '2019-09-03', '2019-09-04'),
('G0013', '132', 'The Paradise Inn', '2019-09-03', '2019-09-04'),
('G0014', '123', 'The Paradise Inn', '2019-10-24', '2019-10-26'),
('G0014', '123', 'The Paradise Inn', '2019-10-27', '2019-10-29');

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
17 rows affected.

[]

In [25]:
%%sql
SELECT * FROM Reservation

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
17 rows affected.

[('G0001', '201', 'Radisson Blu', datetime.date(2019, 5, 29), datetime.date(2019, 6, 5)),
 ('G0002', '107', 'Afriqa', datetime.date(2019, 6, 12), datetime.date(2019, 6, 17)),
 ('G0003', '101', 'Hilton', datetime.date(2019, 10, 20), datetime.date(2019, 10, 29)),
 ('G0004', '203', 'The Building', datetime.date(2019, 10, 15), datetime.date(2019, 10, 25)),
 ('G0005', '100', 'Halloween', datetime.date(2019, 9, 1), datetime.date(2019, 9, 4)),
 ('G0005', '111', 'The Paradise Inn', datetime.date(2019, 9, 9), datetime.date(2019, 9, 13)),
 ('G0007', '122', 'livin hub', datetime.date(2019, 11, 26), datetime.date(2019, 11, 29)),
 ('G0007', '116', 'The Paradise Inn', datetime.date(2019, 9, 3), datetime.date(2019, 9, 8)),
 ('G0010', '104', 'Vision Resort', datetime.date(2019, 9, 3), datetime.date(2019, 9, 4)),
 ('G0010', '104', 'Vision Resort', datetime.date(2019, 9, 10), datetime.date(2019, 9, 12)),
 ('G0011', '150', 'Halloween', datetime.date(2019, 10, 24), datetime.date(2019, 10, 26)),
 ('G0011', '132', 'The Paradise Inn', datetime.date(2019, 10, 24), datetime.date(2019, 10, 27)),
 ('G0012', '103', 'Welcome Stay', datetime.date(2019, 9, 3), datetime.date(2019, 9, 4)),
 ('G0013', '100', 'Halloween', datetime.date(2019, 9, 3), datetime.date(2019, 9, 4)),
 ('G0013', '132', 'The Paradise Inn', datetime.date(2019, 9, 3), datetime.date(2019, 9, 4)),
 ('G0014', '123', 'The Paradise Inn', datetime.date(2019, 10, 24), datetime.date(2019, 10, 26)),
 ('G0014', '123', 'The Paradise Inn', datetime.date(2019, 10, 27), datetime.date(2019, 10, 29))]

In [27]:
%%sql
DROP TABLE IF EXISTS RoomCost;
CREATE TABLE RoomCost (
	roCategory ENUM('single','double','twin','studio','family') NOT NULL,
	roCost double(5,2) NOT NULL,
	PRIMARY KEY (roCategory,roCost)
) ENGINE=InnoDB

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.
0 rows affected.

[]

Explanation...
ON DELETE CASCADE for roCategory because if the category no longer exists, then its price is meaningless.

In [28]:
%%sql
ALTER TABLE RoomCost ADD FOREIGN KEY (roCategory) REFERENCES RoomCategory (roCategory) ON UPDATE CASCADE ON DELETE CASCADE;

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.

[]

In [29]:
%%sql
INSERT INTO RoomCost (roCategory, roCost) VALUES 
('single', 99),
('double', 77),
('twin', 88),
('studio', 52),
('Family', 124);

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
5 rows affected.

[]

In [30]:
%%sql
SELECT * FROM RoomCost

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
5 rows affected.

[('single', 99.0),
 ('double', 77.0),
 ('twin', 88.0),
 ('studio', 52.0),
 ('family', 124.0)]

In [32]:
%%sql
DROP TABLE IF EXISTS HotelRoomCategory;
CREATE TABLE HotelRoomCategory (
	hotName	varchar(20) NOT NULL,
	roCategory ENUM('single','double','twin','studio','family') NOT NULL,
	PRIMARY KEY (hotName,roCategory)
) ENGINE=InnoDB

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.
0 rows affected.

[]

Explanation ...
This is a linking table that link 2 (Hotel and RoomCategory) together. ON DELETE CASCADE FOR both keys so the table always hold current data records.

In [33]:
%%sql
ALTER TABLE HotelRoomCategory 
ADD FOREIGN KEY (hotName) REFERENCES Hotel (hotName) ON UPDATE CASCADE ON DELETE CASCADE,
ADD FOREIGN KEY (roCategory) REFERENCES RoomCategory (roCategory) ON UPDATE CASCADE ON DELETE CASCADE;

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.

[]

In [34]:
%%sql
INSERT INTO HotelRoomCategory
SELECT
    Room.hotName, Room.roCategory
FROM
    Room
GROUP BY
    Room.hotName, Room.roCategory

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
12 rows affected.

[]

In [35]:
%%sql
SELECT * FROM HotelRoomCategory

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
12 rows affected.

[('livin hub', 'single'),
 ('Radisson Blu', 'single'),
 ('The Paradise Inn', 'single'),
 ('Afriqa', 'double'),
 ('Halloween', 'double'),
 ('livin hub', 'double'),
 ('Hilton', 'studio'),
 ('Welcome Stay', 'studio'),
 ('Radisson Blu', 'family'),
 ('The Building', 'family'),
 ('The Paradise Inn', 'family'),
 ('Vision Resort', 'family')]

In [37]:
%%sql
DROP TABLE IF EXISTS HotelGuest;
CREATE TABLE HotelGuest (
 hotName varchar(30) NOT NULL,
 guestID char(5) NOT NULL,
 numOfVisits int(5) NOT NULL,
 PRIMARY KEY (hotName,guestID)
) ENGINE=InnoDB

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.
0 rows affected.

[]

Explanation ...
This is a linking table that link 2 (Hotel and Guest) together. ON DELETE CASCADE FOR both keys so the table always hold current data records from both tables.

In [38]:
%%sql
ALTER TABLE HotelGuest
ADD CONSTRAINT guest_hotel_fk FOREIGN KEY (guestID) REFERENCES Guest (guestID) ON UPDATE CASCADE ON DELETE CASCADE,
ADD CONSTRAINT hotel_guest_fk FOREIGN KEY (hotName) REFERENCES Hotel (hotName) ON UPDATE CASCADE ON DELETE CASCADE;

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.

[]

In [39]:
%%sql
INSERT INTO HotelGuest SELECT
    Reservation.hotName, Reservation.guestID, COUNT(*)
FROM
    Reservation
WHERE CURRENT_DATE > Reservation.checkOut ## Give only past visits
GROUP BY
    Reservation.hotName, Reservation.guestID

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
9 rows affected.

[]

In [40]:
%%sql
SELECT * FROM HotelGuest

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
9 rows affected.

[('Afriqa', 'G0002', 1),
 ('Halloween', 'G0005', 1),
 ('Halloween', 'G0013', 1),
 ('Radisson Blu', 'G0001', 1),
 ('The Paradise Inn', 'G0005', 1),
 ('The Paradise Inn', 'G0007', 1),
 ('The Paradise Inn', 'G0013', 1),
 ('Vision Resort', 'G0010', 2),
 ('Welcome Stay', 'G0012', 1)]

Explanation ...
We decided to create this view to compute the cost of a particular booking. It computes the cost by multiplying the cost of a room with the duration of the stay of the booking. We will use it to answer query 4 and 5.
We decided that creating a view would be more efficient than using nested statements every time we want to compute the cost of a booking.

In [41]:
%%sql
CREATE VIEW ResRecord AS
SELECT Guest.gusName AS GuestName, Reservation.roomNumber AS RoomNumber, Reservation.hotName AS HotelName, Reservation.checkIn, Reservation.checkOut, datediff(Reservation.checkOut, Reservation.checkIn) AS Duration, RoomCost.roCost AS CostPerNight, RoomCost.roCost * (datediff(Reservation.checkOut, Reservation.checkIn)) AS Total
FROM RoomCost, Reservation, Guest, Room
WHERE Guest.guestID=Reservation.guestID 
AND Reservation.roomNumber=Room.roomNumber 
AND Room.roCategory=RoomCost.roCategory

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.

[]

In [42]:
%%sql
SELECT * FROM ResRecord

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
17 rows affected.

[('Mohamed Bennis', '111', 'The Paradise Inn', datetime.date(2019, 9, 9), datetime.date(2019, 9, 13), 4, 99.0, 396.0),
 ('Jessica Marro', '122', 'livin hub', datetime.date(2019, 11, 26), datetime.date(2019, 11, 29), 3, 99.0, 297.0),
 ('Sara Johnson', '201', 'Radisson Blu', datetime.date(2019, 5, 29), datetime.date(2019, 6, 5), 7, 99.0, 693.0),
 ('Mohamed Bennis', '100', 'Halloween', datetime.date(2019, 9, 1), datetime.date(2019, 9, 4), 3, 77.0, 231.0),
 ('Jared Crowe', '100', 'Halloween', datetime.date(2019, 9, 3), datetime.date(2019, 9, 4), 1, 77.0, 77.0),
 ('Mike Jackson', '107', 'Afriqa', datetime.date(2019, 6, 12), datetime.date(2019, 6, 17), 5, 77.0, 385.0),
 ('Laura Gray', '150', 'Halloween', datetime.date(2019, 10, 24), datetime.date(2019, 10, 26), 2, 77.0, 154.0),
 ('Crisiant Manuel', '101', 'Hilton', datetime.date(2019, 10, 20), datetime.date(2019, 10, 29), 9, 52.0, 468.0),
 ('Bin Mike', '103', 'Welcome Stay', datetime.date(2019, 9, 3), datetime.date(2019, 9, 4), 1, 52.0, 52.0),
 ('William Smith', '104', 'Vision Resort', datetime.date(2019, 9, 3), datetime.date(2019, 9, 4), 1, 124.0, 124.0),
 ('William Smith', '104', 'Vision Resort', datetime.date(2019, 9, 10), datetime.date(2019, 9, 12), 2, 124.0, 248.0),
 ('Jessica Marro', '116', 'The Paradise Inn', datetime.date(2019, 9, 3), datetime.date(2019, 9, 8), 5, 124.0, 620.0),
 ('Lee Will', '123', 'The Paradise Inn', datetime.date(2019, 10, 24), datetime.date(2019, 10, 26), 2, 124.0, 248.0),
 ('Lee Will', '123', 'The Paradise Inn', datetime.date(2019, 10, 27), datetime.date(2019, 10, 29), 2, 124.0, 248.0),
 ('Laura Gray', '132', 'The Paradise Inn', datetime.date(2019, 10, 24), datetime.date(2019, 10, 27), 3, 124.0, 372.0),
 ('Jared Crowe', '132', 'The Paradise Inn', datetime.date(2019, 9, 3), datetime.date(2019, 9, 4), 1, 124.0, 124.0),
 (' Andrew Smith', '203', 'The Building', datetime.date(2019, 10, 15), datetime.date(2019, 10, 25), 10, 124.0, 1240.0)]

## 4. Querying the Database [20 Marks]
Populate each of the cells below with the required SQL query.

### a. Provide the name and email of all guests who have stayed in a single bedroom.

In [43]:
%%sql
SELECT Guest.gusName, Guest.gusEmail
FROM Guest, Reservation, Room, RoomCategory
WHERE Guest.guestID = Reservation.guestID
AND Reservation.roomNumber = Room.roomNumber
AND Room.roCategory = RoomCategory.roCategory
AND CURRENT_DATE > Reservation.checkOut ### to give those who HAVE STAYED. (IN THE PAST)
AND Room.roCategory='single'

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
2 rows affected.

[('Mohamed Bennis', 'mohamed@gmail.com'),
 ('Sara Johnson', 'sara.jo@hotmail.com')]

### b. Give the names and cities of hotels with more than 5 family rooms.

In [44]:
%%sql
SELECT Room.hotName, Hotel.hotCity, Room.roCategory
FROM Hotel, Room 
WHERE Room.roCategory='family'
AND Room.hotName=Hotel.hotName
GROUP BY Room.hotName
HAVING COUNT(Room.roCategory='family') > 5

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
1 rows affected.

[('The Paradise Inn', 'Edinburgh', 'family')]

### c. Provide the name and email of guests who have not stayed in Edinburgh.

In [46]:
%%sql
SELECT DISTINCT Guest.gusName, Guest.gusEmail 
FROM Reservation, Hotel, Guest
WHERE  Hotel.hotName = Reservation.hotName
AND Guest.guestID = Reservation.guestID
AND Reservation.guestID NOT IN 
            (SELECT Reservation.guestID FROM Reservation, Hotel, Guest 
              WHERE Hotel.hotName = Reservation.hotName
              AND Guest.guestID = Reservation.guestID
              AND Hotel.hotCity = "Edinburgh")

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
5 rows affected.

[('Sara Johnson', 'sara.jo@hotmail.com'),
 ('Crisiant Manuel', 'crisiant.m@hotmail.com'),
 (' Andrew Smith', 'andrew.smith@gmail.com'),
 ('William Smith', 'william@gmail.com'),
 ('Bin Mike', 'bin@gmail.com')]

### d. How many rooms are booked for 24 October 2019 and what will be the total income?

In [47]:
%%sql
SELECT COUNT(ResRecord.RoomNumber) AS RoomCount, SUM(ResRecord.CostPerNight) AS Total_Income
FROM ResRecord
WHERE '2019-10-24' BETWEEN ResRecord.checkIn AND ResRecord.checkOut

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
1 rows affected.

[(5, 501.0)]

### e. What is the name of the customer who has had the most expensive stay?

In [48]:
%%sql
SELECT ResRecord.GuestName, ResRecord.Total
FROM ResRecord
WHERE ResRecord.Total = (SELECT MAX(ResRecord.Total) FROM ResRecord) ## nESTED QUERY

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
1 rows affected.

[(' Andrew Smith', 1240.0)]

In [ ]:
########################
########################
Incomplete attempt at capturing the constraint 
"The database should track the cost a customer paid for a stay, even if the room rate changes at some later date." 
We could not fully capture that constraint. From our research, we found that using triggers would probably solve the problem.
However, we did not have enough time to implement the solution the way we imagined it (There is probably a simpler way that
we could not think of). The cells below are our attempt to track the hisoty of the changes in room costs. But we could not 
use it to compute the overall cost of previous bookings.

In [49]:
%%sql
CREATE TABLE RoomCost_history (
  roCategory enum('single','double','twin','studio','family') NOT NULL,
  roCost double(5,2) NOT NULL,
  modified_timestamp timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB;

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
0 rows affected.

[]

In [50]:
%%sql
INSERT INTO RoomCost_history (roCategory, roCost)
    SELECT roCategory as roCategory, roCost as roCost
    FROM RoomCost

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
5 rows affected.

[]

In [51]:
%%sql
SELECT * FROM RoomCost_history

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
5 rows affected.

[('single', 99.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('double', 77.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('twin', 88.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('studio', 52.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('family', 124.0, datetime.datetime(2019, 10, 24, 12, 25, 41))]

In [52]:
%%sql
UPDATE RoomCost 
SET RoomCost.roCost = 120
WHERE RoomCost.roCategory = "family"

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
1 rows affected.

[]

In [53]:
%%sql
INSERT INTO RoomCost_history (roCategory, roCost)
    SELECT
      RoomCost.roCategory as roCategory,
      RoomCost.roCost as roCost
    FROM RoomCost, RoomCost_history
    WHERE RoomCost.roCategory=RoomCost_history.roCategory
    AND RoomCost.roCost!=RoomCost_history.roCost

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
1 rows affected.

[]

In [54]:
%%sql
SELECT * FROM RoomCost_history

 * mysql+pymysql://mib2:***@mysql-server-1.macs.hw.ac.uk:3306/mib2
6 rows affected.

[('single', 99.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('double', 77.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('twin', 88.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('studio', 52.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('family', 124.0, datetime.datetime(2019, 10, 24, 12, 25, 41)),
 ('family', 120.0, datetime.datetime(2019, 10, 24, 12, 25, 52))]